Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/studying_in_ireland/immigration_nonEEA_students.html.txt.tmx
Source language: en
Languages: ga

source: Immigration rules for full-time non-EEA students
ga: Rialacha inimirce do mhic léinn lánaimseartha neamh-LEE

source: Non-EEA nationals coming to study in Ireland must be enrolled in an eligible full-time course
ga: Ní mór do náisiúnaigh neamh-LEE atá ag teacht chun staidéar a dhéanamh in Éirinn, bheith cláraithe i gcúrsa lánaimseartha incháilithe

source: There have been several changes to the immigration rules for non-EEA students in 2015 and 2016 – see below
ga: Bhí roinnt athraithe ar na rialacha inimirce do mhic léinn neamh-LEE i 2015 agus 2016 – féach thíos

source: A list of frequently asked questions for non-EEA students is available on the website of the Irish Naturalisation and Immigration Service (INIS), inis.gov.ie
ga: Tá liosta ceisteanna coitianta do mhic léinn neamh-LEE ar fáil ar an láithreán gréasáin na Seirbhíse Eadóirseachta agus Inimirce na hÉireann (SEIÉ), inis.gov.ie

source: Students who are from a country that requires a visa to enter Ireland, must apply for a student visa
ga: Caithfidh mic léinn ó thír a dteastaíonn víosa uathu chun teacht isteach go hÉirinn cur isteach ar víosa mac léinn

source: Their visa application must include evidence that they have access to €7,000 when they come to Ireland
ga: Caithfidh a n-iarratas víosa fianaise a chuimsigh go bhfuil rochtain ar €7,000 acu nuair tagann siad in Éirinn

source: All non-EEA students, including those who do not require a visa, must register with their local immigration officer to get permission to remain in Ireland for more than 90 days
ga: Caithfidh gach mac léinn neamh-LEE, ina n-áirítear iad siúd nach dteastaíonn víosa uathu, clárú leis an oifigeach inimirce áitiúil chun cead a fháil fanacht in Éirinn níos mó ná 90 lá

source: Students who do not require a visa must have €3,000 when they first register with their local immigration officer, if they are coming to study for more than 6 months
ga: Má tá siad ag déanamh staidéar ar feadh 6 mhí nó níos mó, ní mór do mhic léinn nach dteastaíonn víosa uathu €3,000 a bheith acu chun clárú leis an oifigeach inimirce áitiúil don chéad uair

source: A number of measures based on the policy statement, Reform of the International Education System and Student Immigration Sector (pdf) have been implemented
ga: Tá roinnt beart bunaithe ar an ráiteas beartas, Athchóiriú ar an gCóras Oideachais Idirnáisiúnta agus ar Earnáil Inimirce na Mac Léinn (pdf) á gcur i bhfeidhm

source: • Since 1 January 2015, standardisation of the working year for the concession that allows non-EEA students to work – see 'Work' below
ga: • Ón 1 Eanáir 2015, caighdeánú ar an mbliain oibre don lamháltas a cheadaíonn do mhic léinn nach mic léinn LEE iad a bheith ag obair – féach 'Obair' thíos

source: • Since 20 January 2016, an updated Interim List of Eligible Programmes (ILEP) for student immigration purposes, made up of:
ga: • Ón 20 Eanáir 2016, Liosta Eatramhaigh de Chláir Incháilithe (ILEP) nuashonraithe chun críocha inimirce mac léinn, comhdhéanta de:

source: □ Higher education programmes: in general (with some exceptions) restricted to programmes accredited by Irish awarding bodies or those accredited by certain EU universities - see 'Higher education programmes' below
ga: □ Cláir ardoideachais: teoranta go ginearálta (le roinnt eisceachtaí) do chláir arna gcreidiúnú ag comhlachtaí dámhachtana Éireannacha nó iad siúd arna gcreidiúnú ag ollscoileanna áirithe an AE – féach ‘Cláir ardoideachais’ thíos

source: □ English-language programmes: The ILEP is the only list of recognised programmes for student immigration purposes – see ‘English-language programmes’ below
ga: □ Cláir Bhéarla: tá an ILEP ar an aon liosta clár aitheanta chun críocha inimirce mac léinn – féach ‘Cláir Bhéarla’ thíos

source: • Since 21 January 2016, the immigration permission to attend a 25-week English-language course is reduced from 12 months to 8 months
ga: • Ón 21 Eanáir 2016, laghdóidh an cead inimirce freastal ar chúrsa Béarla 25 seachtaine ó 12 mí go dtí 8 mí

source: • All private providers on the ILEP have to meet additional requirements, including learner protection and a separate accounts facility to safeguard student advance payments
ga: • Tá ar gach soláthraí príobháideach ar an ILEP riachtanais bhreise a bhaint amach, lena n-áirítear cosaint foghlaimeora agus áis chuntais ar leith chun réamhíocaíochtaí mac léinn a chosaint

source: • There will be an enhanced inspection and compliance regime in order to monitor educational quality and immigration compliance
ga: • Cuirfear córas iniúchta agus comhlíonta feabhsaithe i bhfeidhm d’fhonn monatóireacht a dhéanamh ar cháilíocht oideachais agus ar chomhlíonadh inimirce

source: Closure of private colleges: The website studenttaskforce.ie provides information for students affected by the closure of private colleges
ga: Coláistí príobháideacha a dhúnadh: Soláthraíonn an suíomh gréasáin studenttaskforce.ie faisnéis do mhic léinn a bhí thíos leis nuair a dúnadh roinnt coláistí príobháideacha

source: INIS has advised students applying to alternative colleges to obtain written details of the college’s Learner Protection arrangements
ga: Cuireann INIS comhairle ar mhic léinn atá ag déanamh iarratas ar choláistí eile sonraí scríofa a fháil de shocruithe Cosanta Foghlaimeora an choláiste

source: The Irish Council for International Students has published information about Learner Protection
ga: D’fhoilsigh an Chomhairle do Mhic Léinn Idirnáisiúnta in Éirinn eolas faoi Chosaint Foghlaimeora

source: Non-EEA nationals coming to study in Ireland must be enrolled in a full-time course in one of the following categories
ga: Caithfidh gach mac léinn neamh-LEE atá ag teacht chun staidéar a dhéanamh in Éirinn a bheith cláraithe i gcúrsa lánaimseartha i gceann den 2 chatagóir seo a leanas

source: They are not allowed to come to Ireland to do a part-time or distance learning course
ga: Níl cead ag mic léinn neamh-LEE teacht go hÉirinn chun cúrsa páirtaimseartha nó cianfhoghlama a dhéanamh

source: Since 1 June 2015, non-EEA nationals can enrol in an eligible course at level 6 or above on the National Framework of Qualifications (NFQ)
ga: Ón 1 Meitheamh 2015, féadfaidh náisiúnaithe nach náisiúnaithe LEE iad clárú i gcúrsa incháilithe ag leibhéal 6 nó níos airde ar an gCreat Náisiúnta Cáilíochtaí (NFQ)

source: Eligible courses are listed on the updated Interim List of Eligible Programmes (ILEP)
ga: Tá cúrsaí incháilithe liostaithe ar an gcéad Liosta Eatramhach de Chláir Incháilithe (ILEP)

source: The maximum time they can study in Ireland at this level is 7 years
ga: Is é an t-uasmhéid ama ar féidir leo staidéar a dhéanamh ag an leibhéal seo ná 7 mbliana

source: There are exceptions to this limit for students doing a Ph.D or a course such as medicine and for students in special circumstances such as illness
ga: Tá eisceachtaí don teorainn seo do mhic léinn a bhfuil dochtúireacht ar siúl acu nó cúrsa ar nós leigheas agus do mhic léinn a bhfuil cúinsí speisialta acu, ar nós tinneas

source: Students must have a certain standard of English
ga: Caithfidh mic léinn caighdeán áirithe Béarla a bheith acu

source: They must also prove that they are progressing in the course, for example, passing exams
ga: Ní féidir le mic léinn athrú ón gClár Céime chuig an gClár Teanga agus Neamh-Chéim

source: INIS has published Guidelines for Degree Programme Students (pdf), listing immigration requirements for students on higher education programmes, including the requirement to have medical insurance (pdf)
ga: Tá sonraí an chláir, cosúil leis an ngá le hárachas leighis (pdf) agus riachtanais eile inimirce liostaithe i dTreoirlínte do Mhic léinn Clár Céime (pdf) atá foilsithe ar shuíomh gréasáin na Seirbhíse Eadóirseachta agus Inimirce na hÉireann (SEIÉ)

source: Third Level Graduate Scheme: When they graduate, students may get an extension of their permission to remain in Ireland under the Third Level Graduate Scheme (pdf)
ga: Scéim Chéimithe Tríú Leibhéal: Nuair a chéimníonn mic léinn, is féidir leo síneadh a fháil ar a gcead fanachta in Éirinn faoin Scéim Chéimithe Tríú Leibhéal (pdf)

source: The scheme allows them to find employment and apply for a General Employment Permit or Critical Skills Employment Permit
ga: Ligeann an scéim dóibh fostaíocht a lorg agus iarratas ar Chead Fostaíochta Scileanna Criticiúla nó Cead Fostaíochta Ginearálta a dhéanamh

source: Graduates with a level 7 qualification may get a 6-month extension to their residence permission
ga: is féidir le céimithe le cáilíocht Leibhéal 7 síneadh 6 mhí a fháil ar a gcead cónaithe

source: Graduates with qualifications at levels 8-10 may get a 12-month extension to their permission
ga: Is féidir le céimithe le cáilíochtaí ag leibhéil 8-10 síneadh 12 mí a fháil ar a gceadú

source: If they are granted permission to remain, from 1 February 2016 they will get stamp 1G
ga: Má fhaigheann siad cead fanacht, gheobhaidh siad stampa 1G ó 1 Feabhra 2016

source: Since 20 January 2016, eligible English-language courses are listed in the updated Interim List of Eligible Programmes (ILEP)
ga: Ón 20 Eanáir 2016, tá cúrsaí Béarla incháilithe liostaithe sa Liosta Eatramhach de Chláir Incháilithe (ILEP) nuashonraithe

source: Further education programmes and overseas-accredited vocational education and training programmes are no longer listed as eligible courses and the Internationalisation Register has ceased to exist
ga: Ní liostaítear cláir bhreisoideachais agus cláir ghairmoideachais agus oiliúna arna gcreidiúnú thar lear mar chúrsaí incháilithe a thuilleadh agus níl ann don Chlár Idirnáisiúnaithe a thuilleadh

source: The immigration permission to attend a 25-week English-language course is for 8 months (was 12 months)
ga: Tá an cead inimirce freastal ar chúrsa Béarla 25 seachtaine 8 mí (12 mí roimhe seo)

source: This applies to first-time and renewal registrations with effect from 21 January 2016
ga: Baineann sé le cláraithe nua agus athnuachana ón 21 Eanáir 2016

source: Existing permissions are not affected. New students attending language courses may be granted permission for a maximum of 3 language courses
ga: D’fhéadfadh mic léinn nua ag freastal cúrsaí teanga cead inimirce ar feadh uasmhéid 3 bhliain a fháil

source: This amounts to a total immigration permission of 2 years (3 x 8 months)
ga: Is ionann an cead inimirce seo agus 2 bhliain iomlán (3 x 8 mí)

source: INIS has published an overview of conditions for language programme students listing immigration requirements for such students
ga: Tá sonraí riachtanais inimirce eile liostaithe san fhorbhreathnú forálacha do mhac léinn clár teanga atá foilsithe ag an tSeirbhís Eadóirseachta agus Inimirce na hÉireann

source: Students registered before 1 January 2011
ga: Mic léinn atá cláraithe roimh 1 Eanáir 2011

source: There are specific arrangements for non-EEA students who were registered in Ireland before 1 January 2011 (pdf)
ga: Tá socruithe sonracha do mhic léinn neamh-LEE atá cláraithe in Éirinn roimh 1 Eanáir 2011 (pdf)

source: Probationary extension: From 28 August 2012 to 26 February 2013 certain non-EEA national students resident in Ireland since before 1 January 2005 were granted a special Student Probationary Extension
ga: Síneadh promhaidh: Ón 28 Lúnasa 2012 go dtí an 26 Feabhra 2013, Síneadh Promhaidh speisialta mac léinn do mhic léinn áirithe neamh-LEE a bhí ina gcónaí in Éirinn roimh an 1 Eanáir 2005

source: They got a stamp 2 permission for 2 years followed by a temporary six-month Stamp 4 permission
ga: Tugadh cead stampa 2 dóibh ar feadh 2 bhliain agus ina dhiaidh sin, cead stampa 4 sealadach ar feadh 6 mhí

source: Then, after an application procedure, eligible students were granted a stamp 4 permission to remain in Ireland
ga: Ansin, tar éis nós imeachta iarratais, deonaíodh stampa 4 cead fanachta in Éirinn do mhic léinn incháilithe

source: Students may not change course during the first year of study
ga: Ní féidir le mic léinn cúrsa a athrú i rith na chéad bhliana den staidéar

source: After that they may be allowed to change to another course, provided it is at the same or a higher level
ga: Ina dhiaidh sin, d’fhéadfaí go mbeadh cead acu athrú chuig cúrsa eile, ar an tuisicint go bhfuil an leibhéal mar an gcéanna nó níos airde

source: They may not change from a full-time to a part-time course
ga: Ní féidir leo athrú ó chúrsa lánaimseartha go cúrsa páirtaimseartha

source: Non-EEA students with Stamp 2 permission to remain are allowed to take up casual employment
ga: Tá cead ag mic léinn neamh-LEE le ceadúnas fanachta Stampa 2 fostaíocht ócáideach a thógáil

source: They can work up to 20 hours a week during term time and up to 40 hours a week in the holidays
ga: Féadfaidh siad oibriú suas go dtí 20 uair sa tseachtain i rith am téarma agus suas go dtí 40 uair in aghaidh na seachtaine sa tsaoire

source: Holiday periods have been standardised – June to September inclusive and from 15 December to 15 January
ga: Ón 1 Eanáir 2015, ní féidir le mic léinn a bhfuil stampa 2 acu oibriú ach 40 uair sa tseachtain idir Meitheamh agus Meán Fómhair, an mhí sin san áireamh, agus idir an 15 Nollaig agus an 15 Eanáir

source: Since 1 September 2016 there are changes to the rules allowing non-EEA students to work
ga: Ó 1 Meán Fómhair 2016 tá athruithe ar na rialacha a cheadaíonn mic léinn neamh-LEE a oibriú

source: Students with stamp 2A permission are not allowed to work
ga: Níl cead ag mic léinn a bhfuil ceadúnas Stampa 2A acu oibriú

source: Non-EEA students are not entitled to social welfare payments
ga: Níl mic léinn neamh-LEE i dteideal íocaíochtaí leasa shóisialaigh in Éirinn

source: One of the conditions of their residence permission is that they have enough money to support themselves and live in Ireland without claiming State benefits
ga: Is é coinníoll a gcead cónaithe go bhfuil dóthain airgid acu chun iad féin a thacú agus bheith ina gcónaí in Éirinn gan iarratas ar shochair Stáit a dhéanamh

source: As a general rule non-EEA students coming to Ireland have no right to bring their family with them
ga: Mar riail ghinearálta, níl aon chead ag mic léinn neamh-LEE atá ag teacht go hÉirinn a dteaghlach a thabhairt leo

source: Spouses, partners and children of non-EEA nationals can apply to enter and live in Ireland in their own right, but they cannot apply on the basis of their relationship to a non-EEA student
ga: Is féidir le céilí, páirtithe agus leanaí de náisiúnaithe neamh-LEE cur isteach ar iontráil agus cónaí in Éirinn ina gceart féin, ach ní féidir leo cur isteach air ar bhunús a gcaidrimh le mac léinn neamh-LEE

source: There are some exceptions to this rule, for example, for Ph.D. students or for students who can prove they have sufficient funds to support their family
ga: Tá roinnt eisceachtaí ar an riail seo, mar shampla, do mhic léinn dochtúireachta nó do mhic léinn ar féidir leo a chruthú go bhfuil a ndóthain maoine acu tacú lena dteaghlach

source: In addition there are transitional arrangements for the children of non-EEA students who were already in Ireland on 1 January 2011 (pdf)
ga: Maille leis sin tá socruithe idirthréimhseacha do leanaí mhic léinn neamh-LEE a raibh in Éirinn ar an 1 Eanáir 2011 (pdf)

source: Short-stay language courses and semesters
ga: Cúrsaí teanga agus seimeastair ghearrfhanachta

source: There are special arrangements for non-EEA students coming to Ireland to do a short English language course (pdf)
ga: Chomh maith leis an dá chlár thuas tá socruithe speisialta do mhic léinn neamh-LEE atá ag teacht go hÉirinn chun cúrsa gearr Béarla a dhéanamh (pdf)

source: The course must be for less than 90 days
ga: Caithfidh go mbeidh an cúrsa seo níos giorra ná 90 lá

source: There are also specific immigration requirements for non-EEA students coming to study for a semester (pdf)
ga: Tá riachtanais speisialta inimirce do mhic léinn neamh-LEE ag teacht chun staidéar ar feadh seimeastair (pdf)
